app/controllers/songs_controller.rb

  def new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
---
SELECT "artists".* FROM "artists"

  def create
    @song = Song.new(song_params)
    @song.save
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a test song!"], ["artist_id", 1], ["created_at", "2016-02-01 09:00:33.478413"], ["updated_at", "2016-02-01 09:00:33.478413"]]

  def edit
    if params[:artist_id]
   artist = Artist.find_by(id: params[:artist_id])
   if artist.nil?
     redirect_to artists_path, alert: "Artist not found."
   else
     @song = artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]